---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.ClosedShell
source: html/e7dbd26c-ef27-f95c-8b14-87764e86b35a.htm
---
# Autodesk.Revit.DB.Mechanical.Space.ClosedShell Property

Return the closedShell of the space.

## Syntax (C#)
```csharp
public GeometryElement ClosedShell { get; }
```